---
kind: property
id: P:Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.FramingProfileService
source: html/bc3003b2-11c2-9dfe-46f5-3c29eead76db.htm
---
# Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.FramingProfileService Property

The external service responsible for the generation of the fabrication profile.

## Syntax (C#)
```csharp
public static ExternalServiceId FramingProfileService { get; }
```